gap> START_TEST("ClassicalMaximals.tst");

#
gap> Length(ClassicalMaximalsGeneric("L", 2, 4));
3
gap> Length(ClassicalMaximalsGeneric("L", 2, 5));
3
gap> Length(ClassicalMaximalsGeneric("L", 2, 7));
3
gap> Length(ClassicalMaximalsGeneric("L", 2, 8));
3
gap> Length(ClassicalMaximalsGeneric("L", 2, 9));
3
gap> Length(ClassicalMaximalsGeneric("L", 2, 11));
2
gap> Length(ClassicalMaximalsGeneric("L", 2, 13));
4
gap> Length(ClassicalMaximalsGeneric("L", 2, 16));
4
gap> Length(ClassicalMaximalsGeneric("L", 2, 17));
5
gap> Length(ClassicalMaximalsGeneric("L", 2, 19));
3
gap> Length(ClassicalMaximalsGeneric("L", 3, 2));
3
gap> Length(ClassicalMaximalsGeneric("L", 3, 3));
4
gap> Length(ClassicalMaximalsGeneric("L", 3, 4));
6
gap> Length(ClassicalMaximalsGeneric("L", 3, 5));
5
gap> Length(ClassicalMaximalsGeneric("L", 3, 7));
8
gap> Length(ClassicalMaximalsGeneric("L", 3, 8));
5
gap> Length(ClassicalMaximalsGeneric("L", 3, 9));
7
gap> Length(ClassicalMaximalsGeneric("L", 3, 11));
5
gap> Length(ClassicalMaximalsGeneric("L", 3, 13));
8
gap> Length(ClassicalMaximalsGeneric("L", 3, 16));
8
gap> Length(ClassicalMaximalsGeneric("L", 3, 17));
5
gap> Length(ClassicalMaximalsGeneric("L", 3, 19));
10
gap> Length(ClassicalMaximalsGeneric("L", 4, 2));
5
gap> Length(ClassicalMaximalsGeneric("L", 4, 3));
8
gap> Length(ClassicalMaximalsGeneric("L", 4, 4));
8
gap> Length(ClassicalMaximalsGeneric("L", 4, 5));
13
gap> Length(ClassicalMaximalsGeneric("L", 4, 7));
10
gap> Length(ClassicalMaximalsGeneric("L", 4, 8));
8
gap> Length(ClassicalMaximalsGeneric("L", 4, 9));
18
gap> Length(ClassicalMaximalsGeneric("L", 4, 11));
10
gap> Length(ClassicalMaximalsGeneric("L", 4, 13));
14
gap> Length(ClassicalMaximalsGeneric("L", 4, 16));
9
gap> Length(ClassicalMaximalsGeneric("L", 4, 17));
16
gap> Length(ClassicalMaximalsGeneric("L", 4, 19));
10
gap> Length(ClassicalMaximalsGeneric("L", 5, 2));
5
gap> Length(ClassicalMaximalsGeneric("L", 5, 3));
6
gap> Length(ClassicalMaximalsGeneric("L", 5, 4));
7
gap> Length(ClassicalMaximalsGeneric("L", 5, 5));
7
gap> Length(ClassicalMaximalsGeneric("L", 5, 7));
7
gap> Length(ClassicalMaximalsGeneric("L", 5, 8));
7
gap> Length(ClassicalMaximalsGeneric("L", 5, 9));
9
gap> Length(ClassicalMaximalsGeneric("L", 5, 11));
16
gap> Length(ClassicalMaximalsGeneric("L", 5, 13));
7
gap> Length(ClassicalMaximalsGeneric("L", 5, 16));
12
gap> Length(ClassicalMaximalsGeneric("L", 5, 17));
7
gap> Length(ClassicalMaximalsGeneric("L", 5, 19));
7
gap> Length(ClassicalMaximalsGeneric("L", 6, 2));
9
gap> Length(ClassicalMaximalsGeneric("L", 6, 3));
13
gap> Length(ClassicalMaximalsGeneric("L", 6, 4));
17
gap> Length(ClassicalMaximalsGeneric("L", 6, 5));
14
gap> Length(ClassicalMaximalsGeneric("L", 6, 7));
20
gap> Length(ClassicalMaximalsGeneric("L", 6, 8));
13
gap> Length(ClassicalMaximalsGeneric("L", 6, 9));
18
gap> Length(ClassicalMaximalsGeneric("L", 6, 11));
14
gap> Length(ClassicalMaximalsGeneric("L", 6, 13));
20
gap> Length(ClassicalMaximalsGeneric("L", 6, 16));
18
gap> Length(ClassicalMaximalsGeneric("L", 6, 17));
14
gap> Length(ClassicalMaximalsGeneric("L", 6, 19));
20
gap> Length(ClassicalMaximalsGeneric("L", 7, 2));
7
gap> Length(ClassicalMaximalsGeneric("L", 7, 3));
8
gap> Length(ClassicalMaximalsGeneric("L", 7, 4));
9
gap> Length(ClassicalMaximalsGeneric("L", 7, 5));
9
gap> Length(ClassicalMaximalsGeneric("L", 7, 7));
9
gap> Length(ClassicalMaximalsGeneric("L", 7, 8));
22
gap> Length(ClassicalMaximalsGeneric("L", 7, 9));
11
gap> Length(ClassicalMaximalsGeneric("L", 7, 11));
9
gap> Length(ClassicalMaximalsGeneric("L", 7, 13));
9
gap> Length(ClassicalMaximalsGeneric("L", 7, 16));
10
gap> Length(ClassicalMaximalsGeneric("L", 7, 17));
9
gap> Length(ClassicalMaximalsGeneric("L", 7, 19));
9
gap> Length(ClassicalMaximalsGeneric("L", 8, 2));
10
gap> Length(ClassicalMaximalsGeneric("L", 8, 3));
16
gap> Length(ClassicalMaximalsGeneric("L", 8, 4));
14
gap> Length(ClassicalMaximalsGeneric("L", 8, 5));
25
gap> Length(ClassicalMaximalsGeneric("L", 8, 7));
17
gap> Length(ClassicalMaximalsGeneric("L", 8, 8));
14
gap> Length(ClassicalMaximalsGeneric("L", 8, 9));
31
gap> Length(ClassicalMaximalsGeneric("L", 8, 11));
17
gap> Length(ClassicalMaximalsGeneric("L", 8, 13));
25
gap> Length(ClassicalMaximalsGeneric("L", 8, 16));
15
gap> Length(ClassicalMaximalsGeneric("L", 8, 17));
33
gap> Length(ClassicalMaximalsGeneric("L", 8, 19));
17
gap> Length(ClassicalMaximalsGeneric("L", 9, 2));
11
gap> Length(ClassicalMaximalsGeneric("L", 9, 3));
12
gap> Length(ClassicalMaximalsGeneric("L", 9, 4));
17
gap> Length(ClassicalMaximalsGeneric("L", 9, 5));
13
gap> Length(ClassicalMaximalsGeneric("L", 9, 7));
20
gap> Length(ClassicalMaximalsGeneric("L", 9, 8));
13
gap> Length(ClassicalMaximalsGeneric("L", 9, 9));
15
gap> Length(ClassicalMaximalsGeneric("L", 9, 11));
13
gap> Length(ClassicalMaximalsGeneric("L", 9, 13));
20
gap> Length(ClassicalMaximalsGeneric("L", 9, 16));
18
gap> Length(ClassicalMaximalsGeneric("L", 9, 17));
13
gap> Length(ClassicalMaximalsGeneric("L", 9, 19));
32
gap> Length(ClassicalMaximalsGeneric("L", 10, 2));
13
gap> Length(ClassicalMaximalsGeneric("L", 10, 3));
17
gap> Length(ClassicalMaximalsGeneric("L", 10, 4));
17
gap> Length(ClassicalMaximalsGeneric("L", 10, 5));
18
gap> Length(ClassicalMaximalsGeneric("L", 10, 7));
18
gap> Length(ClassicalMaximalsGeneric("L", 10, 8));
17
gap> Length(ClassicalMaximalsGeneric("L", 10, 9));
22
gap> Length(ClassicalMaximalsGeneric("L", 10, 11));
30
gap> Length(ClassicalMaximalsGeneric("L", 10, 13));
18
gap> Length(ClassicalMaximalsGeneric("L", 10, 16));
26
gap> Length(ClassicalMaximalsGeneric("L", 10, 17));
18
gap> Length(ClassicalMaximalsGeneric("L", 10, 19));
18
gap> Length(ClassicalMaximalsGeneric("L", 11, 2));
11
gap> Length(ClassicalMaximalsGeneric("L", 11, 3));
12
gap> Length(ClassicalMaximalsGeneric("L", 11, 4));
13
gap> Length(ClassicalMaximalsGeneric("L", 11, 5));
13
gap> Length(ClassicalMaximalsGeneric("L", 11, 7));
13
gap> Length(ClassicalMaximalsGeneric("L", 11, 8));
13
gap> Length(ClassicalMaximalsGeneric("L", 11, 9));
15
gap> Length(ClassicalMaximalsGeneric("L", 11, 11));
13
gap> Length(ClassicalMaximalsGeneric("L", 11, 13));
13
gap> Length(ClassicalMaximalsGeneric("L", 11, 16));
14
gap> Length(ClassicalMaximalsGeneric("L", 11, 17));
13
gap> Length(ClassicalMaximalsGeneric("L", 11, 19));
13
gap> Length(ClassicalMaximalsGeneric("L", 12, 2));
18
gap> Length(ClassicalMaximalsGeneric("L", 12, 3));
24
gap> Length(ClassicalMaximalsGeneric("L", 12, 4));
26
gap> Length(ClassicalMaximalsGeneric("L", 12, 5));
27
gap> Length(ClassicalMaximalsGeneric("L", 12, 7));
33
gap> Length(ClassicalMaximalsGeneric("L", 12, 8));
22
gap> Length(ClassicalMaximalsGeneric("L", 12, 9));
33
gap> Length(ClassicalMaximalsGeneric("L", 12, 11));
25
gap> Length(ClassicalMaximalsGeneric("L", 12, 13));
39
gap> Length(ClassicalMaximalsGeneric("L", 12, 16));
27
gap> Length(ClassicalMaximalsGeneric("L", 12, 17));
27
gap> Length(ClassicalMaximalsGeneric("L", 12, 19));
33

#
gap> Length(ClassicalMaximalsGeneric("U", 3, 3));
3
gap> Length(ClassicalMaximalsGeneric("U", 3, 4));
4
gap> Length(ClassicalMaximalsGeneric("U", 3, 5));
2
gap> Length(ClassicalMaximalsGeneric("U", 3, 7));
5
gap> Length(ClassicalMaximalsGeneric("U", 3, 8));
7
gap> Length(ClassicalMaximalsGeneric("U", 3, 9));
5
gap> Length(ClassicalMaximalsGeneric("U", 3, 11));
8
gap> Length(ClassicalMaximalsGeneric("U", 3, 13));
5
gap> Length(ClassicalMaximalsGeneric("U", 3, 16));
4
gap> Length(ClassicalMaximalsGeneric("U", 3, 17));
10
gap> Length(ClassicalMaximalsGeneric("U", 3, 19));
5
gap> Length(ClassicalMaximalsGeneric("U", 4, 2));
5
gap> Length(ClassicalMaximalsGeneric("U", 4, 3));
10
gap> Length(ClassicalMaximalsGeneric("U", 4, 4));
7
gap> Length(ClassicalMaximalsGeneric("U", 4, 5));
10
gap> Length(ClassicalMaximalsGeneric("U", 4, 7));
16
gap> Length(ClassicalMaximalsGeneric("U", 4, 8));
8
gap> Length(ClassicalMaximalsGeneric("U", 4, 9));
10
gap> Length(ClassicalMaximalsGeneric("U", 4, 11));
14
gap> Length(ClassicalMaximalsGeneric("U", 4, 13));
10
gap> Length(ClassicalMaximalsGeneric("U", 4, 16));
7
gap> Length(ClassicalMaximalsGeneric("U", 4, 17));
10
gap> Length(ClassicalMaximalsGeneric("U", 4, 19));
14
gap> Length(ClassicalMaximalsGeneric("U", 5, 2));
5
gap> Length(ClassicalMaximalsGeneric("U", 5, 3));
7
gap> Length(ClassicalMaximalsGeneric("U", 5, 4));
11
gap> Length(ClassicalMaximalsGeneric("U", 5, 5));
7
gap> Length(ClassicalMaximalsGeneric("U", 5, 7));
7
gap> Length(ClassicalMaximalsGeneric("U", 5, 8));
7
gap> Length(ClassicalMaximalsGeneric("U", 5, 9));
16
gap> Length(ClassicalMaximalsGeneric("U", 5, 11));
7
gap> Length(ClassicalMaximalsGeneric("U", 5, 13));
7
gap> Length(ClassicalMaximalsGeneric("U", 5, 16));
6
gap> Length(ClassicalMaximalsGeneric("U", 5, 17));
7
gap> Length(ClassicalMaximalsGeneric("U", 5, 19));
16
gap> Length(ClassicalMaximalsGeneric("U", 6, 2));
10
gap> Length(ClassicalMaximalsGeneric("U", 6, 3));
14
gap> Length(ClassicalMaximalsGeneric("U", 6, 4));
12
gap> Length(ClassicalMaximalsGeneric("U", 6, 5));
20
gap> Length(ClassicalMaximalsGeneric("U", 6, 7));
14
gap> Length(ClassicalMaximalsGeneric("U", 6, 8));
17
gap> Length(ClassicalMaximalsGeneric("U", 7, 2));
8
gap> Length(ClassicalMaximalsGeneric("U", 7, 3));
9
gap> Length(ClassicalMaximalsGeneric("U", 7, 8));
9
gap> Length(ClassicalMaximalsGeneric("U", 7, 13));
22
gap> Length(ClassicalMaximalsGeneric("U", 8, 2));
11
gap> Length(ClassicalMaximalsGeneric("U", 8, 3));
25
gap> Length(ClassicalMaximalsGeneric("U", 8, 4));
13
gap> Length(ClassicalMaximalsGeneric("U", 8, 5));
17
gap> Length(ClassicalMaximalsGeneric("U", 8, 8));
14
gap> Length(ClassicalMaximalsGeneric("U", 9, 2));
14
gap> Length(ClassicalMaximalsGeneric("U", 9, 3));
13
gap> Length(ClassicalMaximalsGeneric("U", 9, 4));
12
gap> Length(ClassicalMaximalsGeneric("U", 9, 5));
20
gap> Length(ClassicalMaximalsGeneric("U", 9, 8));
17
gap> Length(ClassicalMaximalsGeneric("U", 10, 2));
14
gap> Length(ClassicalMaximalsGeneric("U", 10, 3));
18
gap> Length(ClassicalMaximalsGeneric("U", 11, 2));
12
gap> Length(ClassicalMaximalsGeneric("U", 11, 3));
13
gap> Length(ClassicalMaximalsGeneric("U", 12, 2));
21
gap> Length(ClassicalMaximalsGeneric("U", 12, 3));
27

#
gap> Length(ClassicalMaximalsGeneric("S", 4, 3));
5
gap> Length(ClassicalMaximalsGeneric("S", 4, 4));
7
gap> Length(ClassicalMaximalsGeneric("S", 4, 5));
7
gap> Length(ClassicalMaximalsGeneric("S", 4, 7));
8
gap> Length(ClassicalMaximalsGeneric("S", 4, 8));
7
gap> Length(ClassicalMaximalsGeneric("S", 4, 9));
8
gap> Length(ClassicalMaximalsGeneric("S", 4, 11));
7
gap> Length(ClassicalMaximalsGeneric("S", 4, 13));
7
gap> Length(ClassicalMaximalsGeneric("S", 4, 16));
7
gap> Length(ClassicalMaximalsGeneric("S", 4, 17));
8
gap> Length(ClassicalMaximalsGeneric("S", 4, 19));
7
gap> Length(ClassicalMaximalsGeneric("S", 6, 2));
7
gap> Length(ClassicalMaximalsGeneric("S", 6, 3));
8
gap> Length(ClassicalMaximalsGeneric("S", 6, 4));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 5));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 7));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 8));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 9));
11
gap> Length(ClassicalMaximalsGeneric("S", 6, 11));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 13));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 16));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 17));
9
gap> Length(ClassicalMaximalsGeneric("S", 6, 19));
9
gap> Length(ClassicalMaximalsGeneric("S", 8, 2));
9
gap> Length(ClassicalMaximalsGeneric("S", 8, 3));
12
gap> Length(ClassicalMaximalsGeneric("S", 8, 4));
11
gap> Length(ClassicalMaximalsGeneric("S", 8, 5));
13
gap> Length(ClassicalMaximalsGeneric("S", 8, 7));
14
gap> Length(ClassicalMaximalsGeneric("S", 8, 8));
11
gap> Length(ClassicalMaximalsGeneric("S", 8, 9));
14
gap> Length(ClassicalMaximalsGeneric("S", 8, 11));
13
gap> Length(ClassicalMaximalsGeneric("S", 8, 13));
13
gap> Length(ClassicalMaximalsGeneric("S", 8, 16));
11
gap> Length(ClassicalMaximalsGeneric("S", 8, 17));
14
gap> Length(ClassicalMaximalsGeneric("S", 8, 19));
13
gap> Length(ClassicalMaximalsGeneric("S", 10, 2));
10
gap> Length(ClassicalMaximalsGeneric("S", 10, 3));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 4));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 5));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 7));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 8));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 9));
14
gap> Length(ClassicalMaximalsGeneric("S", 10, 11));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 13));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 16));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 17));
12
gap> Length(ClassicalMaximalsGeneric("S", 10, 19));
12
gap> Length(ClassicalMaximalsGeneric("S", 12, 2));
14
gap> Length(ClassicalMaximalsGeneric("S", 12, 3));
17
gap> Length(ClassicalMaximalsGeneric("S", 12, 4));
16
gap> Length(ClassicalMaximalsGeneric("S", 12, 5));
18
gap> Length(ClassicalMaximalsGeneric("S", 12, 7));
18
gap> Length(ClassicalMaximalsGeneric("S", 12, 8));
16
gap> Length(ClassicalMaximalsGeneric("S", 12, 9));
20
gap> Length(ClassicalMaximalsGeneric("S", 12, 11));
18
gap> Length(ClassicalMaximalsGeneric("S", 12, 13));
18
gap> Length(ClassicalMaximalsGeneric("S", 12, 16));
16
gap> Length(ClassicalMaximalsGeneric("S", 12, 17));
18
gap> Length(ClassicalMaximalsGeneric("S", 12, 19));
18

#
gap> STOP_TEST("ClassicalMaximals.tst", 0);
